Repository: altairos/MiLens-iOS
Catalog: MiLens/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: de, en, fr, ja, ko, zh_hant

# upload.step.02.title
source: 打开微信红包封面开放平台
de: Öffne die WeChat-Plattform für Red-Packet-Cover
en: Open the WeChat Red Packet Cover Platform
fr: Ouvrir la plateforme de couvertures WeChat
ja: WeChatの赤い封筒のカバーを開くオープンプラットフォーム
zh_hant: 打開微信紅包封面開放平台

# upload.step.03.desc
source: 不要二次压缩，确认主体完整。
de: Komprimiere das Bild nicht erneut; stelle sicher, dass das Motiv vollständig ist.
en: Don't recompress the image; make sure the subject is complete.
fr: Ne compressez pas l'image et vérifiez que le sujet est complet.
ja: 2重圧縮は行わず、本体が完成していることを確認してください。
zh_hant: 不要二次壓縮，確認主體完整。

# upload.step.03.title
source: 上传封面图并检查裁切
de: Lade das Cover hoch und überprüfe den Zuschnitt
en: Upload the Cover and Check the Crop
fr: Mettre en ligne et vérifier le recadrage
ja: カバー画像をアップロードしてトリミングを確認する
zh_hant: 上傳封面圖並檢查裁切

# upload.step.04.desc
source: 审核状态与结果由微信平台提供。
de: WeChat stellt den Überprüfungsstatus und das Ergebnis bereit.
en: WeChat provides the review status and result.
fr: Le statut et le résultat de validation sont gérés par WeChat.
ja: レビューのステータスと結果は、WeChatプラットフォームによって提供されます。
zh_hant: 審核狀態與結果由微信平台提供。

# upload.step.04.title
source: 按平台流程提交审核
de: Zur Plattform-Überprüfung einreichen
en: Submit for Platform Review
fr: Soumettre pour validation
ja: プラットフォームのプロセスに従って審査のために送信する
zh_hant: 按平台流程提交審核

# upload.title
source: 上传指引
de: Anleitung zum Hochladen
en: Upload Guide
fr: Guide de mise en ligne
ja: アップロードのガイドライン
zh_hant: 上傳指引

source: 为它创建第一份档案
de: Erstelle das erste Haustierprofil
en: Create their first profile
fr: Créer son premier profil
ja: その最初のファイルを作成します
zh_hant: 為牠建立第一份檔案

source: 保存
de: Speichern
en: Save
fr: Enregistrer
zh_hant: 儲存

source: 保存后将以 PNG 格式保留透明背景
de: Beim Speichern als PNG bleibt der Hintergrund transparent
en: Saves as PNG to keep the transparent background
fr: Le PNG conserve le fond transparent
ja: 透明な背景は保存後もPNG形式で保持されます
zh_hant: 儲存後將以 PNG 格式保留透明背景

source: 分享
de: Teilen
en: Share
fr: Partager
ja: 共有

source: 原图预览 · 生成后这里会实时显示拼豆效果
de: Originalvorschau · Der Perleneffekt erscheint hier nach der Generierung
en: Original preview · the bead effect will appear here after generation
fr: Aperçu de la photo d'origine · Le rendu en perles s'affichera ici après génération
ja: 元画像プレビュー ・生成直後にスペル効果が表示されます。
zh_hant: 原圖預覽 · 產生後這裡會即時顯示拼豆效果

source: 可在「设置 → 隐私 → 照片」中开启，也可以稍后在相册页授权
de: Du kannst den Zugriff unter Einstellungen → Datenschutz & Sicherheit → Fotos oder später auf der Seite „Fotos“ erlauben
en: You can grant access in Settings → Privacy & Security → Photos, or do it later from the Photos page
fr: Vous pouvez autoriser l'accès dans Réglages → Confidentialité et sécurité → Photos, ou plus tard depuis l'écran Photos
ja: 「設定 → プライバシーとセキュリティ → 写真」でオンにすることも、後でアルバムページで承認することもできます
zh_hant: 可在「設定 → 隱私權與安全性 → 照片」中開啟，也可以稍後在相簿頁授權

source: 启用"只拼主体"时会自动抠图；失败后仍会使用原图继续生成
de: Wenn „Nur Motiv“ aktiviert ist, wird das Haustiermotiv automatisch freigestellt; bei Fehlschlag wird das Originalfoto verwendet.
en: Enabling “Subject Only” automatically removes the background around your pal; if that fails, the original photo is used
fr: « Sujet uniquement » détoure automatiquement le compagnon. En cas d'échec, la photo d'origine est utilisée.
ja: 「本体のみ」を有効にすると自動で記憶されます。失敗後も、元のイメージが引き続き使用されて生成が継続されます。
zh_hant: 啟用「只拼主體」時會自動去背；失敗後仍會使用原圖繼續產生

source: 和它一起的每一天
de: Jeder Tag mit deinem Liebling
en: Every day with your pal
fr: Chaque jour avec votre compagnon
ja: 毎日それと一緒に
zh_hant: 和牠在一起的每一天

source: 咪Lens
de: MiLens
en: MiLens
fr: MiLens
ja: MiLens

source: 图纸尺寸
de: Mustergröße
en: Pattern Size
fr: Taille du modèle
ja: アートワークのサイズ
zh_hant: 圖稿尺寸

source: 头像选择功能将在后续版本支持
de: Avatar-Auswahl folgt in einer späteren Version.
en: Avatar selection will be available in a future update
fr: Le choix d'avatar arrivera dans une prochaine version
ja: 写真選択機能は次のバージョンでサポートされる予定です
zh_hant: 大頭貼選取功能將在後續版本支援

source: 字号
de: Schriftgröße
en: Font Size
fr: Taille de police
ja: フォントレベル
zh_hant: 字級

source: 它叫什么名字？
de: Wie heißt dein Liebling?
en: What is their name?
fr: Quel est son nom ?
ja: その名前は何ですか？
zh_hant: 牠叫什麼名字？

source: 宠物卡片
de: Haustierkarte
en: Pal Card
fr: Carte du compagnon
ja: 毛むくじゃらの子供のカード
zh_hant: 毛小孩卡片

source: 开始使用
de: Los geht's
en: Get Started
fr: Commencer
ja: 始めましょう
zh_hant: 開始使用

source: 当前方案
de: Aktuelle Einstellungen
en: Current Settings
fr: Offre actuelle
ja: 現在の計画
zh_hant: 目前方案

source: 我们找到了它
de: Wir haben deinen Liebling gefunden
en: We found your pal
fr: Nous avons retrouvé votre compagnon
ja: 私たちはそれを見つけました
zh_hant: 我們找到了牠

source: 我已阅读并同意
de: Ich habe gelesen und stimme zu
en: I have read and agree to
fr: J'ai lu et j'accepte
ja: 読んで同意します
zh_hant: 我已閱讀並同意

source: 把它的一生，留在这里
de: Bewahre sein ganzes Leben hier auf
en: Keep their whole life right here
fr: Conservez toute son histoire ici
ja: 一生ここに残しておいてください
zh_hant: 把牠的一生，留在這裡

source: 拼豆图纸
de: Bügelperlen-Muster
en: Bead Pattern
fr: Modèle de perles à repasser
ja: ピンドゥオのアートワーク
zh_hant: 拼豆圖稿

source: 推荐：拼豆插画
de: Empfohlen: Bügelperlen-Illustration
en: Recommended: Bead Illustration
fr: Recommandé : Illustration en perles
ja: おすすめ：ピンドゥのイラスト
zh_hant: 推薦：拼豆插畫

source: 未标注日期
de: Kein Datum
en: No date
fr: Non daté
ja: 日付なし
zh_hant: 未標註日期

source: 材料清单
de: Materialliste
en: Materials List
fr: Liste des fournitures
ja: 素材一覧
zh_hant: 材料清單

source: 档案已创建
de: Profil erstellt
en: Profile Created
fr: Profil créé
ja: ファイルが作成されました
zh_hant: 檔案已建立

source: 概括度
de: Abstraktion
en: Abstraction
fr: Simplification
ja: 一般化

source: 特别的缘分
de: Was für eine besondere Verbindung
en: What a special connection
fr: Un lien si particulier
ja: 特別な運命
zh_hant: 特別的緣分

source: 知道啦
de: Verstanden
en: Got it
fr: Compris
ja: わかった

source: 这位可爱的宝贝和本APP的开发者同一天出生。 感谢屏幕前的你，呵护着如此珍贵的生命。
de: Dieser süße Liebling hat am selben Tag Geburtstag wie der Entwickler der App. Danke, dass du dich um so ein kostbares Leben kümmerst.
en: This lovely one shares a birthday with the app's developer. Thank you for caring for such a precious life.
fr: Cet adorable compagnon est né le même jour que le développeur de l'application. Merci à vous de prendre soin d'une vie si précieuse.
ja: この愛らしい赤ちゃんは、このアプリの開発者と同じ日に生まれました。 スクリーンの前にいて、このような尊い命を守ってくれてありがとう。
zh_hant: 這位可愛的寶貝和本 App 的開發者同一天出生。 感謝螢幕前的你，呵護著如此珍貴的生命。

source: 选择效果
de: Effekt auswählen
en: Choose Effect
fr: Choisir un effet
ja: エフェクトを選択
zh_hant: 選擇效果

source: 隐私优先
de: Datenschutz zuerst
en: Privacy First
fr: Confidentialité avant tout
ja: プライバシー第一
zh_hant: 隱私優先

source: 颜色数量
de: Farbanzahl
en: Color Count
fr: Nombre de couleurs
ja: 色量
zh_hant: 顏色數量

source: 颜色过渡
de: Farbübergang
en: Color Transition
fr: Dégradé de couleurs
ja: 色の変化
zh_hant: 顏色過渡

source: 💡 放大图纸即可显示编号
de: 💡 Zoome in das Muster, um Zahlen anzuzeigen
en: 💡 Zoom into the pattern to reveal numbers
fr: 💡 Zoomez pour afficher les numéros des perles
ja: 💡 アートワークを拡大すると番号が表示されます
zh_hant: 💡 放大圖稿即可顯示編號

# create.bead.a4pdf
source: Pro · A4 PDF
fr: Pro · PDF A4

# quota.locked.badge
source: Pro
ja: プロ

# redpacket.spec
source: 957 × 1278 px PNG（< 500 KB）
ja: 957 × 1278ピクセルPNG（< 500 KB）

# settings.section.pro
source: MiLens Pro
ja: MiLensプロ
